Tekla.Structures.Model.Solid
The Solid class represents the physical object in the model created by a part instance.
A solid instance can be used to query the actual geometry of the part and intersect that
geometry with, for example, lines and planes.
using Tekla.Structures.Model;
using Tekla.Structures.Solid;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Beam MyPart = new Beam(new Point(0,0,0), new Point(1000,0,0));
MyPart.Profile.ProfileString = "HEA300";
MyPart.Insert();
new Model().CommitChanges();
ArrayList MyList = new ArrayList();
ArrayList MyFaceNormalList = new ArrayList();
Solid Solid = MyPart.GetSolid();
FaceEnumerator MyFaceEnum = Solid.GetFaceEnumerator();
while (MyFaceEnum.MoveNext())
{
Face MyFace = MyFaceEnum.Current as Face;
if (MyFace != null)
{
MyFaceNormalList.Add(MyFace.Normal);
LoopEnumerator MyLoopEnum = MyFace.GetLoopEnumerator();
while (MyLoopEnum.MoveNext())
{
Loop MyLoop = MyLoopEnum.Current as Loop;
if (MyLoop != null)
{
VertexEnumerator MyVertexEnum = MyLoop.GetVertexEnumerator() as VertexEnumerator;
while (MyVertexEnum.MoveNext())
{
Point MyVertex = MyVertexEnum.Current as Point;
if (MyVertex != null)
{
MyList.Add(MyVertex);
}
}
}
}
}
}
}
}

Tekla.Structures.Model.Solid.faceList
List of solid faces. Each item of the list is itself a list of loops,
and each loop is a list of vertexes.

Tekla.Structures.Model.Solid.edgeList
List of global edges.

Tekla.Structures.Model.Solid.normalVectorList
List of face normal vectors.

Tekla.Structures.Model.Solid.shellIndexList
List of face shell indices.

Tekla.Structures.Model.Solid.originPartIdList
List of face origin part ids.

Tekla.Structures.Model.Solid.intersectionFaceList
List of all faces with loop points fetched with intersection.

Tekla.Structures.Model.Solid.intersectionPointsList
List of points fetched with GetAllIntersectionPoints

Tekla.Structures.Model.Solid.ShellCount
The number of shells the solid consists of. -1 if unknown. Computation can be expensive.

Tekla.Structures.Model.Solid.solidId
Identifier of the solid.

Tekla.Structures.Model.Solid.solidCreationType
Creation type of the solid.

Tekla.Structures.Model.Solid.solidFormingStates
Forming states of the solid.

Tekla.Structures.Model.Solid.MinimumPoint
Gets the minimum axis-aligned point of the solid in the current plane.

Tekla.Structures.Model.Solid.MaximumPoint
Gets the maximum axis-aligned point of the solid in the current plane.

Tekla.Structures.Model.Solid.#ctor(Tekla.Structures.Identifier)
Initializes a new instance of the Tekla.Structures.Model.Solid class.
solidId: Solid id.

Tekla.Structures.Model.Solid.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Model.Solid.SolidCreationTypeEnum)
Initializes a new instance of the Tekla.Structures.Model.Solid class.
solidId: Solid id.
creationType: Creation type.

Tekla.Structures.Model.Solid.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Forming.FormingStates)
Initializes a new instance of the Tekla.Structures.Model.Solid class.
solidId: Solid id.
formingStates: Solid forming states.

Tekla.Structures.Model.Solid.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Model.Solid.SolidCreationTypeEnum,Tekla.Structures.Forming.FormingStates)
Initializes a new instance of the Tekla.Structures.Model.Solid class.
solidId: Solid id.
creationType: Creation type
formingStates: Solid forming states.

Tekla.Structures.Model.Solid.Intersect(Tekla.Structures.Geometry3d.LineSegment)
Returns a list of line - solid intersection points.
line: The intersection line to be used.
Returns: A list of intersection points.

Tekla.Structures.Model.Solid.Intersect(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Returns a list of line - solid intersection points.
point1: The first end of the intersection line.
point2: The second end of the intersection line.
Returns: A list of intersection points.

Tekla.Structures.Model.Solid.Intersect(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Returns a list of plane - solid intersection points. The first item of the list contains
a list of the outmost intersection polygon and the rest of the items (if there are any)
inner polygons.
point1: The first plane point.
point2: The second plane point.
point3: The third plane point.
Returns: An array list of intersection point lists.

Tekla.Structures.Model.Solid.IntersectAllFaces(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Returns an enumerator for an array list of lists of plane - solid intersection points from all intersecting faces.
The first item of one list contains points of the outmost intersection polygon and then the inner polygons (if there are any).
point1: The first plane point.
point2: The second plane point.
point3: The third plane point.
Returns: An enumerator for an array list of intersection point lists.
using Tekla.Structures.Model;
using Tekla.Structures.Solid;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Beam Beam = new Beam(new Point(0, 0, 0), new Point(500, 0, 0));
Beam.Profile.ProfileString = "HEA400";
Beam.Name = "SolidPlane";
Beam.Finish = "Normal";
Beam.Class = "6";
Beam.Insert();
Solid Solid = Beam.GetSolid();
IEnumerator FaceEnum = Solid.IntersectAllFaces(new Point(0, -50, 0), new Point(1000, -50, 0), new Point(0, -50, 1000));
int FaceIndex = 0;
while (FaceEnum.MoveNext())
{
ArrayList Points = FaceEnum.Current as ArrayList;
IEnumerator LoopsEnum = Points.GetEnumerator();
int LoopIndex = 0;
while (LoopsEnum.MoveNext())
{
ArrayList LoopPoints = LoopsEnum.Current as ArrayList;
if (LoopPoints != null)
{
IEnumerator LoopPointsEnum = LoopPoints.GetEnumerator();
while (LoopPointsEnum.MoveNext())
{
Point SolidPoint = LoopPointsEnum.Current as Point;
if(SolidPoint != null)
{
System.Diagnostics.Debug.WriteLine("Face " + FaceIndex.ToString() + " Loop " + LoopIndex.ToString() + " Point " + SolidPoint.ToString());
}
}
}
LoopIndex++;
}
FaceIndex++;
}
}
}

Tekla.Structures.Model.Solid.GetAllIntersectionPoints(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Used to get all the intersection points between the solid and a plane.
Does not arrange the points into polygons, thus a lot faster.
point1: 1st of the 3 points defining a plane
point2: 2nd of the 3 points defining a plane
point3: 3rd of the 3 points defining a plane
Returns: An IEnumerator containing the intersection points of type the Point

Tekla.Structures.Model.Solid.GetFaceEnumerator
Returns a new face enumerator in the current plane.
Returns: A face enumerator to enumerate through solid faces.

Tekla.Structures.Model.Solid.GetEdgeEnumerator
Returns a new edge enumerator in the current plane.
Returns: An edge enumerator to enumerate through the solid's global edges.

Tekla.Structures.Model.Solid.GetCutPart(Tekla.Structures.Model.Solid)
Returns a shell enumerator for the solid th at results cutting this solid with the given solid.
CuttingPart: The solid to use for cutting.
Returns: An shell enumerator to enumerate through the resulting solid's shells.
using Tekla.Structures.Model;
using Tekla.Structures.Solid;
using Tekla.Structures.Geometry3d;
public class Example
{
private static Beam CreateBeam(Point p1, Point p2, String profileName, bool SetAsOperativeClass)
{
Beam beam1 = new Beam
{
StartPoint = p1,
EndPoint = p2,
Profile = { ProfileString = profileName },
Finish = "PAINT",
Material = { MaterialString = "S235JR" },
Position = { Depth = Position.DepthEnum.MIDDLE },
Class = SetAsOperativeClass ? BooleanPart.BooleanOperativeClassName : "1"
};
return beam1;
}
public void Example1()
{
Beam beam1 = CreateBeam(new Point(1000.0, 1000.0, 0.0), new Point(1000.0, 2000.0, 0.0), "500*500", false);
Beam beam2 = CreateBeam(new Point(500.0, 1500.0, 250.0), new Point(1500.0, 1500.0, 250.0), "500*500", true);
BooleanPart cut = new BooleanPart { Father = beam1 };
cut.SetOperativePart(beam2);
Solid solid1 = beam1.GetSolid(Solid.SolidCreationTypeEnum.RAW);
Solid solid2 = beam1.GetSolid(Solid.SolidCreationTypeEnum.NORMAL);
ShellEnumerator shells = solid1.GetCutPart(solid2);
int shellCount = 0;
List<int> faceCounts = new List<int>();
while (shells.MoveNext())
{
var shell = shells.Current as Shell;
if (shell != null)
{
FaceEnumerator faces = shell.GetFaceEnumerator();
faceCounts.Insert(shellCount, 0);
while(faces.MoveNext())
{
faceCounts[shellCount]++;
}
}
shellCount++;
}
}
}

Tekla.Structures.Model.Solid.IsValid
Returns if the solid is valid.
Returns: The validity of the solid.